report/app/controllers/salles_controller.rb

  def index
    @salles = Salle.all
---
SELECT "salles".* FROM "salles"

  def create
    file = salle_params[:file].read.force_encoding("UTF-8")

    line_num = 0
    file.each_line do |doc|
      line_num += 1

      unless line_num == 1
        item = doc.split("\t")

        @salle = Salle.create({
          purchaser: item[0],
          description: item[1],
          unit_price: item[2],
          quantity: item[3],
          address: item[4],
          provider: item[5]
        })
---
INSERT INTO "salles" ("address", "created_at", "description", "provider", "purchaser", "quantity", "total_price", "unit_price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)