report/app/controllers/salles_controller.rb

SELECT "salles".* FROM "salles"
---
  def list_report
    @salles = Salle.all