report/app/controllers/uploads_controller.rb

SELECT "uploads".* FROM "uploads"
---
  def index
    @uploads = Upload.all

INSERT INTO "uploads" ("created_at", "file", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 01 Feb 2017 18:17:22 UTC +00:00], ["file", ""], ["updated_at", Wed, 01 Feb 2017 18:17:22 UTC +00:00]]
---
  def create
    @upload = Upload.new(upload_params)

    if @upload.save

SELECT "uploads".* FROM "uploads" WHERE "uploads"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_upload
      @upload = Upload.find(params[:id])